cdhooper/amigapci_stm32/fw/pcmds.c
rc_t
cmd_time(int argc, char * const *argv)
{
    rc_t rc;

    if (argc <= 1)
        return (RC_USER_HELP);

    if (strncmp(argv[1], "calibrate", 3) == 0) {
        rtc_calibrate();
        rc = RC_SUCCESS;
    } else if (strcmp(argv[1], "cmd") == 0) {
        uint64_t time_start;
        uint64_t time_diff;

        if (argc <= 2) {
            printf("error: time cmd requires command to execute\n");
            return (RC_USER_HELP);
        }
        time_start = timer_tick_get();
        rc = cmd_exec_argv(argc - 2, argv + 2);
        time_diff = timer_tick_get() - time_start;
        printf("%llu us\n", timer_tick_to_usec(time_diff));
        if (rc == RC_USER_HELP)
            rc = RC_FAILURE;
    } else if (strncmp(argv[1], "now", 1) == 0) {
        uint64_t now = timer_tick_get();
        printf("tick=0x%llx uptime=%llu usec\ntime=",
               now, timer_tick_to_usec(now));
        rtc_print(1);
        amigartc_print();
        rc = RC_SUCCESS;
    } else if (strcmp(argv[1], "set") == 0) {
        rc = cmd_time_set(argc - 1, argv + 1);
    } else if (strncmp(argv[1], "show", 2) == 0) {
        timer_show();
        rc = RC_SUCCESS;
    } else if (strncmp(argv[1], "snoop", 2) == 0) {
        int debug = 0;
        if ((argc > 2) && (*argv[2] == 'd'))
            debug = 1;
        amigartc_snoop(debug);
        rc = RC_USR_ABORT;
    } else if (strncmp(argv[1], "test", 1) == 0) {
        rc = timer_test();
    } else if (strncmp(argv[1], "watch", 1) == 0) {
        rc = timer_watch();
    } else {
        printf("Unknown argument %s\n", argv[1]);
        return (RC_USER_HELP);
    }
    return (rc);
}

rc_t
cmd_map(int argc, char * const *argv)
{
    uint third = (ARRAY_SIZE(memmap) + 2) / 3;
    uint ent;
    for (ent = 0; ent < third; ent++) {
        printf("    %-6s %08x", memmap[ent].name, memmap[ent].addr);
        if (ent + third < ARRAY_SIZE(memmap))
            printf("    %-6s %08x",
                   memmap[ent + third].name, memmap[ent + third].addr);
        if (ent + third * 2 < ARRAY_SIZE(memmap))
            printf("    %-6s %08x",
                   memmap[ent + third * 2].name, memmap[ent + third * 2].addr);
        printf("\n");
    }
    return (RC_SUCCESS);
}

static void
shutdown_all(void)
{
    uart_flush();
    usb_shutdown(1);
    timer_delay_msec(30);
//  adc_shutdown();
    timer_shutdown();
    /* Put all peripherals in reset */
    /* Clear NVIC? */
}

rc_t
cmd_reset(int argc, char * const *argv)
{
    if (argc < 2) {
        printf("Resetting...\n");
        shutdown_all();
        reset_cpu();
        return (RC_FAILURE);
    } else if (strcmp(argv[1], "amiga") == 0) {
        uint hold = 0;
        uint longreset = 0;
        while (argc > 2) {
            if (strcmp(argv[2], "hold") == 0)
                hold = 1;
            else if (strcmp(argv[2], "long") == 0)
                longreset = 1;
            else
                printf("Invalid reset amiga \"%s\"\n", argv[2]);
            argc--;
            argv++;
        }
        kbrst_amiga(hold, longreset);
        if (hold)
            printf("Holding Amiga in reset\n");
        else
            printf("Resetting Amiga\n");
    } else if (strncmp(argv[1], "dfu", 3) == 0) {
        uint isrom = (argv[1][3] == 'r');
        printf("Resetting to DFU%s...\n", isrom ? " in ROM" : "");
        shutdown_all();
        reset_dfu(isrom);
    } else if (strcmp(argv[1], "reason") == 0) {
        show_reset_reason();
    } else if (strcmp(argv[1], "usb") == 0) {
        timer_delay_msec(1);
        usb_shutdown(0);
//      usb_signal_reset_to_host(1);
        usb_init();
    } else {
        printf("Unknown argument %s\n", argv[1]);
        return (RC_USER_HELP);
    }
    return (RC_SUCCESS);
}

rc_t
cmd_amiga(int argc, char * const *argv)
{
    if (argc < 2)
        return (RC_USER_HELP);
    if (strncmp(argv[1], "keyboard", 1) == 0) {
        keyboard_term();
    } else if (strncmp(argv[1], "status", 1) == 0) {
        power_show();
        if (power_state != POWER_STATE_OFF) {
            if (amiga_in_reset)
                printf("Amiga is in reset\n");
        }
        printf("USB Powered     %s\n", usb_is_powered ? "Yes" : "No");
        printf("USB Keyboards   %u\n", usb_keyboard_count);
        printf("USB Mice        %u\n", usb_mouse_count);
        printf("USB Joysticks   %u\n", usb_joystick_count);
        printf("HID Enabled     %s\n", hiden_is_set ? "Yes" : "No");
        printf("Amiga Keyboard  %s sync, %s wake\n",
               amiga_keyboard_lost_sync ? "Lost" :
               amiga_keyboard_has_sync ? "Has" : "No",
               amiga_keyboard_sent_wake ? "Sent" : "Did not send");
    } else {
        printf("Unknown argument %s\n", argv[1]);
        return (RC_USER_HELP);
    }
    return (RC_SUCCESS);
}

rc_t
cmd_cpu(int argc, char * const *argv)
{
    if (argc < 2)
        return (RC_USER_HELP);
    if (strncmp(argv[1], "regs", 1) == 0) {
        fault_show_regs(NULL);
    } else if (strncmp(argv[1], "hardfault", 2) == 0) {
        fault_hard();
    } else {
        printf("Unknown argument %s\n", argv[1]);
        return (RC_USER_HELP);
    }
    return (RC_SUCCESS);
}

rc_t
cmd_fan(int argc, char * const *argv)
{
    int narg = 0;
    uint fan_speed = -1;
    if (argc < 2)
        return (RC_USER_HELP);
    if (strcmp(argv[1], "auto") == 0) {
        fan_speed = BIT(7) | 100;
    } else if (strcmp(argv[1], "off") == 0) {
        fan_speed = 0;
        narg = 2;
    } else if (strcmp(argv[1], "on") == 0) {
        fan_speed = 100;
        narg = 2;
    } else if (strcmp(argv[1], "speed") == 0) {
        int pos = 0;
        int speed;
        if (argc < 3) {
            printf("fan percent value required (0 - 100)\n");
            return (RC_USER_HELP);
        }
        if ((sscanf(argv[2], "%d%n", &speed, &pos) != 1) ||
            (argv[2][pos] != '\0') || (speed < 0) || (speed > 100)) {
            printf("Invalid fan percent value %s\n", argv[2]);
            return (RC_USER_HELP);
        }
        fan_speed = speed;
        narg = 3;
    } else {
        printf("Unknown argument %s\n", argv[1]);
        return (RC_USER_HELP);
    }
    fan_set(fan_speed);
    if (narg < argc) {
        if (strcasecmp(argv[narg], "save") == 0) {
            config.fan_speed = fan_speed;
            config_updated();
        }
    }

    return (RC_SUCCESS);
}

