cdhooper/amigapci_stm32/fw/pcmds.c
rc_t
cmd_power(int argc, char * const *argv)
{
    const char *cmd;
    cmd = skip(argv[0], "power");
    if (*cmd == '\0') {
        if (argc < 2)
            return (RC_USER_HELP);
        argc--;
        argv++;
        cmd = argv[0];
    }
    if (strcmp(cmd, "cycle") == 0) {
        power_set(POWER_STATE_CYCLE);
    } else if (strcmp(cmd, "on") == 0) {
        power_set(POWER_STATE_ON);
    } else if (strcmp(cmd, "off") == 0) {
        power_set(POWER_STATE_OFF);
    } else if (strncmp(cmd, "show", 1) == 0) {
        power_show();
        sensor_show();
    } else {
        printf("Unknown argument %s\n", cmd);
        return (RC_USER_HELP);
    }
    return (RC_SUCCESS);
}

rc_t
cmd_usb(int argc, char * const *argv)
{
    if (strcmp(argv[0], "usb") == 0) {
        argc--;
        argv++;
    }
    if (argc == 0)
        return (RC_USER_HELP);
    if (strncmp(argv[0], "debug", 2) == 0) {
        uint debug_mask;
        int  pos = 0;
        if (argc < 2) {
            printf("usb %s requires an argument\n", argv[0]);
            return (RC_USER_HELP);
        }
        if ((sscanf(argv[1], "%x%n", &debug_mask, &pos) != 1) ||
            (argv[1][pos] != '\0')) {
            printf("Invalid argument to debug: %s\n", argv[1]);
            return (RC_USER_HELP);
        }
        usb_debug_mask = debug_mask;
    } else if (strncmp(argv[0], "disable", 3) == 0) {
        timer_delay_msec(1);
        usb_shutdown(0);
//      usb_signal_reset_to_host(0);
        return (RC_SUCCESS);
    } else if ((strcmp(argv[0], "kbd") == 0) ||
               (strncmp(argv[0], "keyboard", 2) == 0)) {
        if (argc < 2) {
            printf("USB keyboard input: %s\n",
                   usb_keyboard_terminal ? "on" : "off");
        } else if (strcmp(argv[1], "on") == 0) {
            usb_keyboard_terminal = 1;
        } else if (strcmp(argv[1], "off") == 0) {
            usb_keyboard_terminal = 0;
        } else {
            printf("Invalid argument %s\n", argv[1]);
            return (RC_BAD_PARAM);
        }
    } else if (strncmp(argv[0], "ls", 2) == 0) {
        uint verbose = 0;
        while (argc >= 2) {
            if (strncmp(argv[1], "verbose", 1) == 0)
                verbose++;
            argc--;
            argv++;
        }
        usb_ls(verbose);
    } else if (strcmp(argv[0], "off") == 0) {
        usb_set_power(0);
    } else if (strcmp(argv[0], "on") == 0) {
        usb_set_power(1);
    } else if (strncmp(argv[0], "regs", 3) == 0) {
        usb_show_regs();
    } else if (strcmp(argv[0], "reset") == 0) {
        timer_delay_msec(1);
        usb_shutdown(0);
//      usb_signal_reset_to_host(1);
        usb_init();
        return (RC_SUCCESS);
    } else if (strncmp(argv[0], "stat", 2) == 0) {
        usb_show_stats();
    } else {
        printf("Unknown argument %s\n", argv[0]);
        return (RC_USER_HELP);
    }
    return (RC_SUCCESS);
}

rc_t
cmd_gpio(int argc, char * const *argv)
{
    int arg;
    if (argc < 2) {
        gpio_show(-1, 0xffff);
        return (RC_SUCCESS);
    }

    for (arg = 1; arg < argc; arg++) {
        const char *ptr = argv[arg];
        int port = -1;
        uint16_t pins[NUM_GPIO_BANKS];
        const char *assign = NULL;

        memset(pins, 0, sizeof (pins));

        if (gpio_name_match(&ptr, pins) != 0) {
            if ((*ptr == 'p') || (*ptr == 'P'))
                ptr++;

            /* Find port, if specified */
            if ((*ptr >= 'a') && (*ptr <= 'f'))
                port = *(ptr++) - 'a';
            else if ((*ptr >= 'A') && (*ptr <= 'F'))
                port = *(ptr++) - 'A';

            /* Find pin, if specified */
            if ((*ptr >= '0') && (*ptr <= '9')) {
                uint pin = *(ptr++) - '0';
                if ((*ptr >= '0') && (*ptr <= '9'))
                    pin = pin * 10 + *(ptr++) - '0';
                if (pin > 15) {
                    printf("Invalid argument %s\n", argv[arg]);
                    return (RC_BAD_PARAM);
                }
                pins[port] = BIT(pin);
            } else if (*ptr == '*') {
                ptr++;
                pins[port] = 0xffff;
            }
        }

        if (*ptr == '=') {
            assign = ptr + 1;
            ptr = "";
            if (port == -1) {
                uint tport;
                for (tport = 0; tport < NUM_GPIO_BANKS; tport++)
                    if (pins[tport] != 0)
                        break;
                if (tport == NUM_GPIO_BANKS) {
                    printf("You must specify the GPIO to assign: %s\n",
                           argv[arg]);
                    return (RC_BAD_PARAM);
                }
            }
        }
        if (*ptr != '\0') {
            printf("Invalid argument %s\n", argv[arg]);
            return (RC_BAD_PARAM);
        }

        if (assign != NULL) {
            if (port == -1) {
                for (port = 0; port < NUM_GPIO_BANKS; port++) {
                    if (pins[port] != 0) {
                        gpio_assign(port, pins[port], assign);
                    }
                }
            } else {
                gpio_assign(port, pins[port], assign);
            }
        } else {
            if (port == -1) {
                for (port = 0; port < NUM_GPIO_BANKS; port++)
                    gpio_show(port, pins[port]);
            } else {
                gpio_show(port, pins[port]);
            }
        }
    }

    return (RC_SUCCESS);
}

static const char *const debug_flag_bits[] = {
    "RTC", "AmigaKeyboard", "AmigaMouse", "AmigaJoystick",
        "USB", "USBConn", "USBKeyboard", "USBMouse",
    "USBReport", "DecodeMisc", "DecodeMouse", "DecodeJoystick",
        "DecodeKeyboard", "HIDEN", "Fan", "",
    "", "", "", "",
        "", "", "", "",
    "", "", "", "",
        "", "", "", "",
};

static const char *const config_flag_bits[] = {
    "InvertX", "InvertY", "InvertW", "InvertP",
        "SwapXY", "SwapWP", "KeyupWP", "GamepadMouse",
    "", "", "", "",
        "", "", "", "",
    "", "", "", "",
        "", "", "", "",
    "", "", "", "",
        "", "", "", "",
};

static void
decode_bits(const char *const *bits, uint32_t flags)
{
    uint bit;
    uint printed = 0;

    for (bit = 0; bit < 32; bit++) {
        if (flags & BIT(bit)) {
            if (printed++)
                printf(", ");
            if (bits[bit][0] == '\0') {
                printf("bit%u", bit);
            } else {
                printf("%s", bits[bit]);
            }
        }
    }
}

static uint
match_bits(const char *const *bits, const char *name)
{
    uint bit;
    for (bit = 0; bit < 32; bit++) {
        if (strcasecmp(name, bits[bit]) == 0)
            return (bit);
    }
    return (bit);
}

#define CFOFF(x) offsetof(config_t, x), sizeof (config.x)

