cdhooper/amigapci_stm32/fw/pcmds.c
#define MODE_DEC          0       // Show value in decimal
#define MODE_HEX          BIT(0)  // Show value in hexadecimal
#define MODE_STRING       BIT(1)  // Show string
#define MODE_BIT_FLAGS    BIT(2)  // Decode debug flags
#define MODE_FAN_AUTO     BIT(3)  // Interpret BIT(7) as "auto"; 0 = decimal
#define MODE_SIGNED       BIT(4)  // Decimal value is signed
typedef struct {
    const char *cs_name;
    const char *cs_desc;
    uint16_t    cs_offset;  // Offset into config structure
    uint8_t     cs_size;    // Size of config value in bytes
    uint8_t     cs_mode;    // Mode bits for display (1=hex)
} config_set_t;
static const config_set_t config_set[] = {
    { "board_rev",      "Board revision (5=current)",
      CFOFF(board_rev), MODE_DEC },
    { "board_type",     "Board type (1=AmigaPCI, 2=STM32Dev)",
      CFOFF(board_type), MODE_DEC },
    { "cpu_temp_bias",  "Bias (+/-) for CPU temperature",
      CFOFF(cpu_temp_bias), MODE_SIGNED },
    { "debug",         "",
      CFOFF(debug_flag), MODE_HEX | MODE_BIT_FLAGS },
    { "fan_rpm_max",  "Fan maximum speed in RPM",
      CFOFF(fan_rpm_max), MODE_DEC },
    { "fan_speed",     "Fan speed",
      CFOFF(fan_speed), MODE_FAN_AUTO },
    { "fan_speed_min", "Fan speed minimum percent",
      CFOFF(fan_speed_min), MODE_DEC },
    { "fan_temp_max",  "CPU temp for max fan speed",
      CFOFF(fan_temp_max), MODE_DEC },
    { "fan_temp_min",  "CPU temp for min fan speed",
      CFOFF(fan_temp_min), MODE_DEC },
    { "flags",          "",
      CFOFF(flags), MODE_HEX | MODE_BIT_FLAGS },
    { "name",          "Board name",
      CFOFF(name), MODE_STRING },
    { "pson",          "Power on at AC restored",
      CFOFF(ps_on_mode), MODE_DEC },
};

rc_t
cmd_set(int argc, char * const *argv)
{
    if (argc <= 1) {
        uint pos;
        for (pos = 0; pos < ARRAY_SIZE(config_set); pos++) {
            char buf[32];
            const config_set_t *c = &config_set[pos];
            uint cs_mode = c->cs_mode;
            uint value = 0;
            void *src = (void *) ((uintptr_t) &config + c->cs_offset);
            if (cs_mode & MODE_STRING) {
                /* String */
                sprintf(buf, "%s \"%.*s\"",
                        c->cs_name, c->cs_size, (char *)src);
            } else if (cs_mode & MODE_HEX) {
                /* Hexadecimal */
                memcpy(&value, src, c->cs_size);
                sprintf(buf, "%s %0*x", c->cs_name, c->cs_size * 2, value);
            } else {
                /* Decimal : MODE_DEC */
                memcpy(&value, src, c->cs_size);
                if ((cs_mode & MODE_FAN_AUTO) && (value & BIT(7))) {
                    sprintf(buf, "%s %s", c->cs_name, "auto");
                } else if (cs_mode & MODE_SIGNED) {
                    if (c->cs_size == 1)
                        value = (int8_t) value;
                    else if (c->cs_size == 2)
                        value = (int16_t) value;
                    sprintf(buf, "%s %d", c->cs_name, value);
                } else {
                    sprintf(buf, "%s %u", c->cs_name, value);
                }
            }
            printf("%s%*s%s", buf, 24 - strlen(buf), "", c->cs_desc);
            if (cs_mode & MODE_BIT_FLAGS) {
                if (strncmp(c->cs_name, "debug", 5) == 0) {
                    /* Decode debug flags */
                    if (value == 0)
                        printf("Debug flags");
                    decode_bits(debug_flag_bits, value);
                } else if (strncmp(c->cs_name, "flags", 4) == 0) {
                    /* Decode config flags */
                    if (value == 0)
                        printf("Config flags");
                    decode_bits(config_flag_bits, value);
                }
            }
            printf("\n");
        }
        return (RC_SUCCESS);
    }
    if ((strcmp(argv[1], "help") == 0) ||
               (strcmp(argv[1], "?") == 0)) {
        return (RC_USER_HELP);
    } else if (strcmp(argv[1], "cpu_temp_bias") == 0) {
        int pos = 0;
        int bias;
        if (argc != 3) {
            printf("CPU temp bias value required (-100 - 100)\n");
            return (RC_BAD_PARAM);
        }
        if ((sscanf(argv[2], "%d%n", &bias, &pos) != 1) ||
                   (argv[2][pos] != '\0') || (bias < -100) || (bias > 100)) {
            printf("Invalid CPU tempo bias value %s\n", argv[2]);
            return (RC_USER_HELP);
        }
        config.cpu_temp_bias = bias;
        config_updated();
    } else if (strcmp(argv[1], "debug") == 0) {
        int      arg;
        int      pos = 0;
        int      add_sub = 0;
        uint     bit;
        uint     do_save = 0;
        uint     did_set = 0;
        uint32_t value;
        uint32_t nvalue = 0;
        if (argc <= 2) {
            printf("Debug flags are a combination of bits: "
                   "specify all bit numbers or names\n");
            for (bit = 0; bit < 32; bit++)
                if (debug_flag_bits[bit][0] != '\0')
                    printf("  %c %x  %s\n",
                           config.debug_flag & BIT(bit) ? '*' : ' ',
                           bit, debug_flag_bits[bit]);
            printf("Current debug %08lx  ", config.debug_flag);
            decode_bits(debug_flag_bits, config.debug_flag);
            printf("\n");
            return (RC_SUCCESS);
        }
        for (arg = 2; arg < argc; arg++) {
            char *flagname = argv[arg];
            if (*flagname == '+') {
                flagname++;
                add_sub = 1;
            } else if (*flagname == '-') {
                flagname++;
                add_sub = -1;
            }
            if (*flagname == '\0')
                continue;
            if (strcasecmp(flagname, "save") == 0) {
                do_save = 1;
                continue;
            } else if ((bit = match_bits(debug_flag_bits, flagname)) < 32) {
                if (did_set == 0)
                    nvalue = 0;
                nvalue |= BIT(bit);
                did_set = 1;
            } else {
                if ((sscanf(flagname, "%x%n", &value, &pos) != 1) ||
                    (flagname[pos] != '\0')) {
                    printf("Invalid argument: %s\n", flagname);
                    return (RC_USER_HELP);
                }
                if ((pos >= 4) || (value >= 32))
                    nvalue = value;
                else
                    nvalue |= BIT(value);
                did_set = 1;
            }
        }
        if (add_sub > 0)
            nvalue = config.debug_flag | nvalue;
        else if (add_sub < 0)
            nvalue = config.debug_flag & ~nvalue;

        if (config.debug_flag != nvalue) {
            config.debug_flag = nvalue;
            printf("Debug flags %08lx ", nvalue);
            decode_bits(debug_flag_bits, nvalue);
            printf("\n");
        }
        if (do_save)
            config_updated();
    } else if (strncmp(argv[1], "defaults", 7) == 0) {
        if (argc > 2) {
            if (strncmp(argv[2], "keymap", 1) == 0) {
                printf("Resetting keymap\n");
                keyboard_set_defaults();
                config_updated();
            } else {
                printf("Unknown argument %s\n", argv[2]);
                return (RC_USER_HELP);
            }
        } else {
            /* Reset all defaults */
            uint board_type = config.board_type;
            uint board_rev = config.board_rev;
            config_set_defaults();
            config.board_type = board_type;
            config.board_rev = board_rev;
        }
    } else if (strcmp(argv[1], "fan_rpm_max") == 0) {
        int pos = 0;
        int rpm;
        if (argc != 3) {
            printf("fan RPM value required (0 - 32000)\n");
            return (RC_BAD_PARAM);
        }
        if ((sscanf(argv[2], "%d%n", &rpm, &pos) != 1) ||
                   (argv[2][pos] != '\0') || (rpm < 0) || (rpm > 32000)) {
            printf("Invalid fan RPM value %s\n", argv[2]);
            return (RC_USER_HELP);
        }
        config.fan_rpm_max = rpm;
        config_updated();
    } else if (strcmp(argv[1], "fan_speed") == 0) {
        int pos = 0;
        int speed;
        if (argc != 3) {
            printf("fan percent value required (0 - 100) or auto\n");
            return (RC_BAD_PARAM);
        }
        if (strcmp(argv[2], "auto") == 0) {
            speed = BIT(7) | 100;
        } else if ((sscanf(argv[2], "%d%n", &speed, &pos) != 1) ||
                   (argv[2][pos] != '\0') || (speed < 0) || (speed > 100)) {
            printf("Invalid fan percent value %s\n", argv[2]);
            return (RC_USER_HELP);
        }
        fan_set(speed);
        config.fan_speed = speed;
        config_updated();
    } else if (strcmp(argv[1], "fan_speed_min") == 0) {
        int pos = 0;
        int speed;
        if (argc != 3) {
            printf("fan percent value required (0 - 100)\n");
            return (RC_BAD_PARAM);
        }
        if ((sscanf(argv[2], "%d%n", &speed, &pos) != 1) ||
            (argv[2][pos] != '\0') || (speed < 0) || (speed > 100)) {
            printf("Invalid fan percent value %s\n", argv[2]);
            return (RC_USER_HELP);
        }
        config.fan_speed_min = speed;
        config_updated();
    } else if ((strcmp(argv[1], "fan_temp_min") == 0) ||
               (strcmp(argv[1], "fan_temp_max") == 0)) {
        int pos = 0;
        int value;
        if (argc != 3) {
            printf("Integer temperature percent required (0 - 127)\n");
            return (RC_BAD_PARAM);
        }
        if ((sscanf(argv[2], "%d%n", &value, &pos) != 1) ||
            (argv[2][pos] != '\0') || (value < 0) || (value > 127)) {
            printf("Invalid temperature value %s\n", argv[2]);
            return (RC_USER_HELP);
        }
        if (strcmp(argv[1], "fan_temp_min") == 0)
            config.fan_temp_min = value;
        else
            config.fan_temp_max = value;
        config_updated();
    } else if (strncmp(argv[1], "flags", 4) == 0) {
        int      arg;
        int      pos = 0;
        int      add_sub = 0;
        uint     bit;
        uint     do_save = 0;
        uint     did_set = 0;
        uint32_t value;
        uint32_t nvalue = 0;
        if (argc <= 2) {
            printf("Config flags are a combination of bits: "
                   "specify all bit numbers or names\n");
            for (bit = 0; bit < 32; bit++)
                if (config_flag_bits[bit][0] != '\0')
                    printf(" %c %2u  %s\n",
                           config.flags & BIT(bit) ? '*' : ' ',
                           bit, config_flag_bits[bit]);
            printf("Current config %08lx  ", config.flags);
            decode_bits(config_flag_bits, config.flags);
            printf("\n");
            return (RC_SUCCESS);
        }
        for (arg = 2; arg < argc; arg++) {
            char *flagname = argv[arg];
            if (*flagname == '+') {
                flagname++;
                add_sub = 1;
            } else if (*flagname == '-') {
                flagname++;
                add_sub = -1;
            }
            if (*flagname == '\0')
                continue;
            if (strcasecmp(flagname, "save") == 0) {
                do_save = 1;
                continue;
            } else if ((bit = match_bits(config_flag_bits, flagname)) < 32) {
                if (did_set == 0)
                    nvalue = 0;
                nvalue |= BIT(bit);
                did_set = 1;
            } else {
                if ((sscanf(flagname, "%x%n", &value, &pos) != 1) ||
                    (flagname[pos] != '\0')) {
                    printf("Invalid argument: %s\n", flagname);
                    return (RC_USER_HELP);
                }
                if ((pos >= 4) || (value >= 32))
                    nvalue = value;
                else
                    nvalue |= BIT(value);
                did_set = 1;
            }
        }
        if (add_sub > 0)
            nvalue = config.flags | nvalue;
        else if (add_sub < 0)
            nvalue = config.flags & ~nvalue;

